### Data Management with Pandas

Importing libraries

In [347]:
import numpy as np
import pandas as pd

Import the data

In [348]:
df = pd.read_csv("sri_lanka_employees.csv")
df

    Employee_ID                Name  Join_Date     City  Department    Salary
0         25795   Nuwan Gunawardena   4/1/2022   Jaffna          HR   73200.0
1         10860  Rashmi Karunaratne   4/1/2024  Colombo     Finance   59800.0
2         86820    Nuwan Jayasinghe  12/1/2021    Kandy     Finance   59500.0
3         64886        Ruwan Perera  12/1/2019  Colombo     Finance   77600.0
4         16265    Ruwan Rathnayake   6/1/2019   Jaffna          IT       NaN
..          ...                 ...        ...      ...         ...       ...
95        77563    Thilini De Alwis   2/1/2017    Kandy          HR   71400.0
96        12695      Kasun De Alwis   9/1/2022    Galle   Marketing   73900.0
97        58190     Suresh Fernando   5/1/2019    Galle  Operations   79700.0
98        15258   Rashmi Rathnayake   1/1/2021    Kandy          HR       NaN
99        97538      Malsha Bandara  10/1/2025    Kandy  Operations  134600.0

[100 rows x 6 columns]

In [349]:
df_0 = df.copy()
df_0

    Employee_ID                Name  Join_Date     City  Department    Salary
0         25795   Nuwan Gunawardena   4/1/2022   Jaffna          HR   73200.0
1         10860  Rashmi Karunaratne   4/1/2024  Colombo     Finance   59800.0
2         86820    Nuwan Jayasinghe  12/1/2021    Kandy     Finance   59500.0
3         64886        Ruwan Perera  12/1/2019  Colombo     Finance   77600.0
4         16265    Ruwan Rathnayake   6/1/2019   Jaffna          IT       NaN
..          ...                 ...        ...      ...         ...       ...
95        77563    Thilini De Alwis   2/1/2017    Kandy          HR   71400.0
96        12695      Kasun De Alwis   9/1/2022    Galle   Marketing   73900.0
97        58190     Suresh Fernando   5/1/2019    Galle  Operations   79700.0
98        15258   Rashmi Rathnayake   1/1/2021    Kandy          HR       NaN
99        97538      Malsha Bandara  10/1/2025    Kandy  Operations  134600.0

[100 rows x 6 columns]

Study the dataset

In [350]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Employee_ID  100 non-null    int64
 1   Name         100 non-null    object
 2   Join_Date    100 non-null    object
 3   City         100 non-null    object
 4   Department   100 non-null    object
 5   Salary       80 non-null     float64
dtypes: float64(1), int64(1), object(4)
memory usage: 4.8+ KB

In [351]:
df.describe()

        Employee_ID         Salary
count    100.000000      80.000000
mean   58544.920000   96157.500000
std    27846.019844   31583.971961
min    10769.000000   50400.000000
25%    33793.500000   69875.000000
50%    63351.000000   88750.000000
75%    79912.000000  122975.000000
max    99812.000000  149600.000000

In [352]:
df.describe(include="all")

,Employee_ID,Name,Join_Date,City,Department,Salary
count,100.000000,100,100,100,100,80.000000
unique,NaN,69,68,4,5,NaN
top,NaN,Ishara Rathnayake,4/1/2022,Jaffna,HR,NaN
freq,NaN,3,4,29,25,NaN
mean,58544.920000,NaN,NaN,NaN,NaN,96157.500000
std,27846.019844,NaN,NaN,NaN,NaN,31583.971961
min,10769.000000,NaN,NaN,NaN,NaN,50400.000000
25%,33793.500000,NaN,NaN,NaN,NaN,69875.000000
50%,63351.000000,NaN,NaN,NaN,NaN,88750.000000
75%,79912.000000,NaN,NaN,NaN,NaN,122975.000000
max,99812.000000,NaN,NaN,NaN,NaN,149600.000000

In [353]:
df.sample(n=10)

    Employee_ID                Name  Join_Date    City  Department    Salary
0         25795   Nuwan Gunawardena   4/1/2022  Jaffna          HR   73200.0
2         86820    Nuwan Jayasinghe  12/1/2021   Kandy     Finance   59500.0
52        27159       Nuwan Bandara   3/1/2018   Kandy     Finance       NaN
99        97538      Malsha Bandara  10/1/2025   Kandy  Operations  134600.0
51        58555   Nuwan Gunawardena   4/1/2015  Jaffna          IT   51000.0
56        79479       Nuwan Bandara   4/1/2021   Kandy          HR   56800.0
12        77221  Janith Karunaratne  12/1/2016  Jaffna  Operations  119400.0
9         70263  Sajith Gunawardena   4/1/2018   Galle          HR   54000.0
89        61214      Ishara Bandara   6/1/2021  Jaffna          HR  121700.0
15        69735    Nuwan Jayasinghe  10/1/2017  Jaffna  Operations       NaN

In [354]:
df.dtypes

Employee_ID      int64
Name            object
Join_Date       object
City            object
Department      object
Salary         float64
dtype: object

In [355]:
df["Join_Date"] = pd.to_datetime(df["Join_Date"], errors = 'coerce')
df

    Employee_ID                Name  Join_Date     City  Department    Salary
0         25795   Nuwan Gunawardena 2022-04-01   Jaffna          HR   73200.0
1         10860  Rashmi Karunaratne 2024-04-01  Colombo     Finance   59800.0
2         86820    Nuwan Jayasinghe 2021-12-01    Kandy     Finance   59500.0
3         64886        Ruwan Perera 2019-12-01  Colombo     Finance   77600.0
4         16265    Ruwan Rathnayake 2019-06-01   Jaffna          IT       NaN
..          ...                 ...        ...      ...         ...       ...
95        77563    Thilini De Alwis 2017-02-01    Kandy          HR   71400.0
96        12695      Kasun De Alwis 2022-09-01    Galle   Marketing   73900.0
97        58190     Suresh Fernando 2019-05-01    Galle  Operations   79700.0
98        15258   Rashmi Rathnayake 2021-01-01    Kandy          HR       NaN
99        97538      Malsha Bandara 2025-10-01    Kandy  Operations  134600.0

[100 rows x 6 columns]

In [356]:
df

    Employee_ID                Name  Join_Date     City  Department    Salary
0         25795   Nuwan Gunawardena 2022-04-01   Jaffna          HR   73200.0
1         10860  Rashmi Karunaratne 2024-04-01  Colombo     Finance   59800.0
2         86820    Nuwan Jayasinghe 2021-12-01    Kandy     Finance   59500.0
3         64886        Ruwan Perera 2019-12-01  Colombo     Finance   77600.0
4         16265    Ruwan Rathnayake 2019-06-01   Jaffna          IT       NaN
..          ...                 ...        ...      ...         ...       ...
95        77563    Thilini De Alwis 2017-02-01    Kandy          HR   71400.0
96        12695      Kasun De Alwis 2022-09-01    Galle   Marketing   73900.0
97        58190     Suresh Fernando 2019-05-01    Galle  Operations   79700.0
98        15258   Rashmi Rathnayake 2021-01-01    Kandy          HR       NaN
99        97538      Malsha Bandara 2025-10-01    Kandy  Operations  134600.0

[100 rows x 6 columns]

Getting counts of data using value count

In [357]:
df.value_counts()

Employee_ID  Name                  Join_Date   City     Department  Salary
10860        Rashmi Karunaratne    2024-04-01  Colombo  Finance     59800.0     1
11016        Chamari Perera        2025-10-01  Colombo  Marketing   65400.0     1
79479        Nuwan Bandara         2021-04-01  Kandy    HR          56800.0     1
79092        Janith Gunawardena    2023-08-01  Colombo  Operations  50700.0     1
78148        Suresh Karunaratne    2025-09-01  Colombo  Operations  147200.0    1
                                                                               ..
48044        Chamari Silva         2025-12-01  Kandy    HR          141300.0    1
47194        Nadeesha Gunawardena  2020-02-01  Jaffna   HR          138200.0    1
47065        Rashmi Karunaratne    2024-02-01  Colombo  Marketing   85900.0     1
45920        Tharushi Fernando     2021-11-01  Kandy    Operations  59300.0     1
99789        Suresh Gunawardena    2019-11-01  Jaffna   Marketing   54700.0     1
Name: count, Length: 80, dtype: int64

In [358]:
df['City'].value_counts()

City
Jaffna     29
Colombo    24
Kandy      24
Galle      23
Name: count, dtype: int64

In [359]:
df['Name'].value_counts()

Name
Ishara Rathnayake     3
Nuwan Jayasinghe      3
Malsha Bandara        3
Rashmi Karunaratne    3
Janith Gunawardena    3
                     ..
Ruwan Silva           1
Suresh Karunaratne    1
Suresh De Alwis       1
Tharushi Fernando     1
Kasun De Alwis        1
Name: count, Length: 69, dtype: int64

In [360]:
df['Employee_ID'].value_counts()

Employee_ID
25795    1
50757    1
11016    1
50397    1
21534    1
        ..
75725    1
69150    1
12747    1
28431    1
97538    1
Name: count, Length: 100, dtype: int64

In [361]:
len(df) - df['Name'].nunique()

31

Dropping duplicates

In [362]:
df_0

    Employee_ID                Name  Join_Date     City  Department    Salary
0         25795   Nuwan Gunawardena   4/1/2022   Jaffna          HR   73200.0
1         10860  Rashmi Karunaratne   4/1/2024  Colombo     Finance   59800.0
2         86820    Nuwan Jayasinghe  12/1/2021    Kandy     Finance   59500.0
3         64886        Ruwan Perera  12/1/2019  Colombo     Finance   77600.0
4         16265    Ruwan Rathnayake   6/1/2019   Jaffna          IT       NaN
..          ...                 ...        ...      ...         ...       ...
95        77563    Thilini De Alwis   2/1/2017    Kandy          HR   71400.0
96        12695      Kasun De Alwis   9/1/2022    Galle   Marketing   73900.0
97        58190     Suresh Fernando   5/1/2019    Galle  Operations   79700.0
98        15258   Rashmi Rathnayake   1/1/2021    Kandy          HR       NaN
99        97538      Malsha Bandara  10/1/2025    Kandy  Operations  134600.0

[100 rows x 6 columns]

In [363]:
df = df.drop_duplicates()
df

    Employee_ID                Name  Join_Date     City  Department    Salary
0         25795   Nuwan Gunawardena 2022-04-01   Jaffna          HR   73200.0
1         10860  Rashmi Karunaratne 2024-04-01  Colombo     Finance   59800.0
2         86820    Nuwan Jayasinghe 2021-12-01    Kandy     Finance   59500.0
3         64886        Ruwan Perera 2019-12-01  Colombo     Finance   77600.0
4         16265    Ruwan Rathnayake 2019-06-01   Jaffna          IT       NaN
..          ...                 ...        ...      ...         ...       ...
95        77563    Thilini De Alwis 2017-02-01    Kandy          HR   71400.0
96        12695      Kasun De Alwis 2022-09-01    Galle   Marketing   73900.0
97        58190     Suresh Fernando 2019-05-01    Galle  Operations   79700.0
98        15258   Rashmi Rathnayake 2021-01-01    Kandy          HR       NaN
99        97538      Malsha Bandara 2025-10-01    Kandy  Operations  134600.0

[100 rows x 6 columns]

In [364]:
df_0 == df

    Employee_ID  Name  Join_Date  City  Department  Salary
0          True  True       True  True        True    True
1          True  True       True  True        True    True
2          True  True       True  True        True    True
3          True  True       True  True        True    True
4          True  True       True  True        True   False
..          ...   ...        ...   ...         ...     ...
95         True  True       True  True        True    True
96         True  True       True  True        True    True
97         True  True       True  True        True    True
98         True  True       True  True        True   False
99         True  True       True  True        True    True

[100 rows x 6 columns]

### Observing subsets

In [365]:
df.iloc[10:20]

,Employee_ID,Name,Join_Date,City,Department,Salary
10,26023,Dinusha Karunaratne,2016-12-01,Galle,Finance,143600.0
11,51090,Tharushi Gunawardena,2015-04-01,Colombo,Marketing,147800.0
12,77221,Janith Karunaratne,2016-12-01,Jaffna,Operations,119400.0
13,74820,Nuwan Karunaratne,2022-04-01,Colombo,HR,70700.0
14,10769,Dinusha Karunaratne,2021-11-01,Jaffna,Finance,NaN
15,69735,Nuwan Jayasinghe,2017-10-01,Jaffna,Operations,NaN
16,72955,Ruwan Perera,2019-11-01,Galle,Marketing,NaN
17,74925,Kasun Perera,2025-08-01,Galle,Operations,NaN
18,77969,Ishara Rathnayake,2018-06-01,Kandy,Finance,143000.0
19,15311,Ruwan Karunaratne,2017-10-01,Galle,Operations,138600.0

In [366]:
df["City"]

0      Jaffna
1     Colombo
2       Kandy
3     Colombo
4      Jaffna
       ...
95      Kandy
96      Galle
97      Galle
98      Kandy
99      Kandy
Name: City, Length: 100, dtype: object

In [367]:
jaffna_df_0 = df.loc[df["City"]=="Jaffna"]
jaffna_df = jaffna_df_0[["Employee_ID", "Name"]]
jaffna_df

    Employee_ID                  Name
0         25795     Nuwan Gunawardena
4         16265      Ruwan Rathnayake
5         92386       Tharushi Perera
6         47194  Nadeesha Gunawardena
7         97498     Tharushi De Alwis
8         54131          Nuwan Perera
12        77221    Janith Karunaratne
14        10769   Dinusha Karunaratne
15        69735      Nuwan Jayasinghe
28        12747      Ruwan Rathnayake
35        76803     Ishara Rathnayake
37        21394         Rashmi Perera
40        51606      Kasun Jayasinghe
42        97313     Ruwan Gunawardena
44        18792    Chamari Rathnayake
46        53001         Kasun Bandara
48        33897       Tharushi Perera
50        33483      Nuwan Jayasinghe
51        58555     Nuwan Gunawardena
58        29457      Dinusha Fernando
61        88953        Ishara Bandara
68        75697          Malsha Silva
70        42606          Rashmi Silva
74        99789    Suresh Gunawardena
77        33247    Sajith Karunaratne
79        84065        Malsha Bandara
87        18571       Chamari Bandara
89        61214        Ishara Bandara
91        58984    Janith Gunawardena

In [368]:
finance_df = df.loc[df["Department"]=="Finance"]
finance_df

    Employee_ID                 Name  Join_Date     City Department    Salary
1         10860   Rashmi Karunaratne 2024-04-01  Colombo    Finance   59800.0
2         86820     Nuwan Jayasinghe 2021-12-01    Kandy    Finance   59500.0
3         64886         Ruwan Perera 2019-12-01  Colombo    Finance   77600.0
10        26023  Dinusha Karunaratne 2016-12-01    Galle    Finance  143600.0
14        10769  Dinusha Karunaratne 2021-11-01   Jaffna    Finance       NaN
18        77969    Ishara Rathnayake 2018-06-01    Kandy    Finance  143000.0
25        35658       Thilini Perera 2021-03-01  Colombo    Finance       NaN
30        75725       Tharushi Silva 2020-01-01    Galle    Finance   87800.0
36        41551    Malsha Rathnayake 2016-09-01    Galle    Finance       NaN
52        27159        Nuwan Bandara 2018-03-01    Kandy    Finance       NaN
60        87189   Sajith Gunawardena 2022-09-01  Colombo    Finance       NaN
63        50757        Dinusha Silva 2022-07-01  Colombo    Finance  133400.0
66        82409    Nadeesha Fernando 2018-09-01    Galle    Finance  133200.0
68        75697         Malsha Silva 2024-01-01   Jaffna    Finance   51300.0
71        21534         Sajith Silva 2018-06-01    Galle    Finance   76700.0
80        92798       Suresh Bandara 2016-03-01    Kandy    Finance  130200.0
84        73704   Rashmi Karunaratne 2023-02-01    Kandy    Finance       NaN
92        50774   Malsha Karunaratne 2024-04-01    Galle    Finance  118800.0

In [369]:
high_salary  = df[df['Salary']>140000]
high_salary

,Employee_ID,Name,Join_Date,City,Department,Salary
5,92386,Tharushi Perera,2021-07-01,Jaffna,Marketing,144700.0
10,26023,Dinusha Karunaratne,2016-12-01,Galle,Finance,143600.0
11,51090,Tharushi Gunawardena,2015-04-01,Colombo,Marketing,147800.0
18,77969,Ishara Rathnayake,2018-06-01,Kandy,Finance,143000.0
49,78148,Suresh Karunaratne,2025-09-01,Colombo,Operations,147200.0
81,19268,Kasun Jayasinghe,2022-08-01,Colombo,Marketing,149500.0
88,48044,Chamari Silva,2025-12-01,Kandy,HR,141300.0
94,72592,Rashmi Rathnayake,2022-05-01,Galle,HR,149600.0

Using Queries

In [370]:
df

    Employee_ID                Name  Join_Date     City  Department    Salary
0         25795   Nuwan Gunawardena 2022-04-01   Jaffna          HR   73200.0
1         10860  Rashmi Karunaratne 2024-04-01  Colombo     Finance   59800.0
2         86820    Nuwan Jayasinghe 2021-12-01    Kandy     Finance   59500.0
3         64886        Ruwan Perera 2019-12-01  Colombo     Finance   77600.0
4         16265    Ruwan Rathnayake 2019-06-01   Jaffna          IT       NaN
..          ...                 ...        ...      ...         ...       ...
95        77563    Thilini De Alwis 2017-02-01    Kandy          HR   71400.0
96        12695      Kasun De Alwis 2022-09-01    Galle   Marketing   73900.0
97        58190     Suresh Fernando 2019-05-01    Galle  Operations   79700.0
98        15258   Rashmi Rathnayake 2021-01-01    Kandy          HR       NaN
99        97538      Malsha Bandara 2025-10-01    Kandy  Operations  134600.0

[100 rows x 6 columns]

In [371]:
df.query("City == 'Jaffna'").head(10)

    Employee_ID                  Name  Join_Date    City  Department    Salary
0         25795     Nuwan Gunawardena 2022-04-01  Jaffna          HR   73200.0
4         16265      Ruwan Rathnayake 2019-06-01  Jaffna          IT       NaN
5         92386       Tharushi Perera 2021-07-01  Jaffna   Marketing  144700.0
6         47194  Nadeesha Gunawardena 2020-02-01  Jaffna          HR  138200.0
7         97498     Tharushi De Alwis 2022-10-01  Jaffna          HR   68000.0
8         54131          Nuwan Perera 2022-02-01  Jaffna          IT   61900.0
12        77221    Janith Karunaratne 2016-12-01  Jaffna  Operations  119400.0
14        10769   Dinusha Karunaratne 2021-11-01  Jaffna     Finance       NaN
15        69735      Nuwan Jayasinghe 2017-10-01  Jaffna  Operations       NaN
28        12747      Ruwan Rathnayake 2021-03-01  Jaffna          HR   85700.0

In [372]:
df.query("Salary > 140000")

,Employee_ID,Name,Join_Date,City,Department,Salary
5,92386,Tharushi Perera,2021-07-01,Jaffna,Marketing,144700.0
10,26023,Dinusha Karunaratne,2016-12-01,Galle,Finance,143600.0
11,51090,Tharushi Gunawardena,2015-04-01,Colombo,Marketing,147800.0
18,77969,Ishara Rathnayake,2018-06-01,Kandy,Finance,143000.0
49,78148,Suresh Karunaratne,2025-09-01,Colombo,Operations,147200.0
81,19268,Kasun Jayasinghe,2022-08-01,Colombo,Marketing,149500.0
88,48044,Chamari Silva,2025-12-01,Kandy,HR,141300.0
94,72592,Rashmi Rathnayake,2022-05-01,Galle,HR,149600.0

### Handling missing values

In [373]:
df

    Employee_ID                Name  Join_Date     City  Department    Salary
0         25795   Nuwan Gunawardena 2022-04-01   Jaffna          HR   73200.0
1         10860  Rashmi Karunaratne 2024-04-01  Colombo     Finance   59800.0
2         86820    Nuwan Jayasinghe 2021-12-01    Kandy     Finance   59500.0
3         64886        Ruwan Perera 2019-12-01  Colombo     Finance   77600.0
4         16265    Ruwan Rathnayake 2019-06-01   Jaffna          IT       NaN
..          ...                 ...        ...      ...         ...       ...
95        77563    Thilini De Alwis 2017-02-01    Kandy          HR   71400.0
96        12695      Kasun De Alwis 2022-09-01    Galle   Marketing   73900.0
97        58190     Suresh Fernando 2019-05-01    Galle  Operations   79700.0
98        15258   Rashmi Rathnayake 2021-01-01    Kandy          HR       NaN
99        97538      Malsha Bandara 2025-10-01    Kandy  Operations  134600.0

[100 rows x 6 columns]

Checking how many missing values there are

In [374]:
df.isna().sum()

Employee_ID     0
Name            0
Join_Date       0
City            0
Department      0
Salary         20
dtype: int64

In [375]:
df

    Employee_ID                Name  Join_Date     City  Department    Salary
0         25795   Nuwan Gunawardena 2022-04-01   Jaffna          HR   73200.0
1         10860  Rashmi Karunaratne 2024-04-01  Colombo     Finance   59800.0
2         86820    Nuwan Jayasinghe 2021-12-01    Kandy     Finance   59500.0
3         64886        Ruwan Perera 2019-12-01  Colombo     Finance   77600.0
4         16265    Ruwan Rathnayake 2019-06-01   Jaffna          IT       NaN
..          ...                 ...        ...      ...         ...       ...
95        77563    Thilini De Alwis 2017-02-01    Kandy          HR   71400.0
96        12695      Kasun De Alwis 2022-09-01    Galle   Marketing   73900.0
97        58190     Suresh Fernando 2019-05-01    Galle  Operations   79700.0
98        15258   Rashmi Rathnayake 2021-01-01    Kandy          HR       NaN
99        97538      Malsha Bandara 2025-10-01    Kandy  Operations  134600.0

[100 rows x 6 columns]

Summarizing function

In [376]:
salary = df["Salary"]

salary_sum = salary.sum()
salary_count = salary.count()
salary_median = salary.median() 
salary_min = salary.min() 
salary_max = salary.max() 
salary_mean = salary.mean() 
salary_var = salary.var() 
salary_std = salary.std() 
salary_q1 = salary.quantile([0.25,0.75])



print(f"Total salary: {salary_sum}")
print(f"Count getting salary: {salary_count}")
print(f"Median salary: {salary_median}")

Total salary: 7692600.0
Count getting salary: 80
Median salary: 88750.0

In [377]:
salary = df["Salary"]


salary_quantiles = salary.quantile([0.25, 0.5, 0.75]) 
salary_quantiles

0.25     69875.0
0.50     88750.0
0.75    122975.0
Name: Salary, dtype: float64

Fill missing value with zero

In [386]:
df_1 = df_0 

# We can use inplace to overwrite the data frame, but this can sometimes be risky
df_1.fillna({'Salary':0}, inplace=True)
df_1

    Employee_ID                Name  Join_Date     City  Department    Salary
0         25795   Nuwan Gunawardena   4/1/2022   Jaffna          HR   73200.0
1         10860  Rashmi Karunaratne   4/1/2024  Colombo     Finance   59800.0
2         86820    Nuwan Jayasinghe  12/1/2021    Kandy     Finance   59500.0
3         64886        Ruwan Perera  12/1/2019  Colombo     Finance   77600.0
4         16265    Ruwan Rathnayake   6/1/2019   Jaffna          IT       0.0
..          ...                 ...        ...      ...         ...       ...
95        77563    Thilini De Alwis   2/1/2017    Kandy          HR   71400.0
96        12695      Kasun De Alwis   9/1/2022    Galle   Marketing   73900.0
97        58190     Suresh Fernando   5/1/2019    Galle  Operations   79700.0
98        15258   Rashmi Rathnayake   1/1/2021    Kandy          HR       0.0
99        97538      Malsha Bandara  10/1/2025    Kandy  Operations  134600.0

[100 rows x 6 columns]

In [379]:
df

    Employee_ID                Name  Join_Date     City  Department    Salary
0         25795   Nuwan Gunawardena 2022-04-01   Jaffna          HR   73200.0
1         10860  Rashmi Karunaratne 2024-04-01  Colombo     Finance   59800.0
2         86820    Nuwan Jayasinghe 2021-12-01    Kandy     Finance   59500.0
3         64886        Ruwan Perera 2019-12-01  Colombo     Finance   77600.0
4         16265    Ruwan Rathnayake 2019-06-01   Jaffna          IT       NaN
..          ...                 ...        ...      ...         ...       ...
95        77563    Thilini De Alwis 2017-02-01    Kandy          HR   71400.0
96        12695      Kasun De Alwis 2022-09-01    Galle   Marketing   73900.0
97        58190     Suresh Fernando 2019-05-01    Galle  Operations   79700.0
98        15258   Rashmi Rathnayake 2021-01-01    Kandy          HR       NaN
99        97538      Malsha Bandara 2025-10-01    Kandy  Operations  134600.0

[100 rows x 6 columns]

Fill missing value using median

In [380]:
df

    Employee_ID                Name  Join_Date     City  Department    Salary
0         25795   Nuwan Gunawardena 2022-04-01   Jaffna          HR   73200.0
1         10860  Rashmi Karunaratne 2024-04-01  Colombo     Finance   59800.0
2         86820    Nuwan Jayasinghe 2021-12-01    Kandy     Finance   59500.0
3         64886        Ruwan Perera 2019-12-01  Colombo     Finance   77600.0
4         16265    Ruwan Rathnayake 2019-06-01   Jaffna          IT       NaN
..          ...                 ...        ...      ...         ...       ...
95        77563    Thilini De Alwis 2017-02-01    Kandy          HR   71400.0
96        12695      Kasun De Alwis 2022-09-01    Galle   Marketing   73900.0
97        58190     Suresh Fernando 2019-05-01    Galle  Operations   79700.0
98        15258   Rashmi Rathnayake 2021-01-01    Kandy          HR       NaN
99        97538      Malsha Bandara 2025-10-01    Kandy  Operations  134600.0

[100 rows x 6 columns]

In [381]:
df["Salary"].fillna(df["Salary"].median())

0      73200.0
1      59800.0
2      59500.0
3      77600.0
4      88750.0
        ...
95     71400.0
96     73900.0
97     79700.0
98     88750.0
99    134600.0
Name: Salary, Length: 100, dtype: float64

In [382]:
df["Salary"]  = df["Salary"].fillna(df["Salary"].median())
df

    Employee_ID                Name  Join_Date     City  Department    Salary
0         25795   Nuwan Gunawardena 2022-04-01   Jaffna          HR   73200.0
1         10860  Rashmi Karunaratne 2024-04-01  Colombo     Finance   59800.0
2         86820    Nuwan Jayasinghe 2021-12-01    Kandy     Finance   59500.0
3         64886        Ruwan Perera 2019-12-01  Colombo     Finance   77600.0
4         16265    Ruwan Rathnayake 2019-06-01   Jaffna          IT   88750.0
..          ...                 ...        ...      ...         ...       ...
95        77563    Thilini De Alwis 2017-02-01    Kandy          HR   71400.0
96        12695      Kasun De Alwis 2022-09-01    Galle   Marketing   73900.0
97        58190     Suresh Fernando 2019-05-01    Galle  Operations   79700.0
98        15258   Rashmi Rathnayake 2021-01-01    Kandy          HR   88750.0
99        97538      Malsha Bandara 2025-10-01    Kandy  Operations  134600.0

[100 rows x 6 columns]

In [383]:
df

    Employee_ID                Name  Join_Date     City  Department    Salary
0         25795   Nuwan Gunawardena 2022-04-01   Jaffna          HR   73200.0
1         10860  Rashmi Karunaratne 2024-04-01  Colombo     Finance   59800.0
2         86820    Nuwan Jayasinghe 2021-12-01    Kandy     Finance   59500.0
3         64886        Ruwan Perera 2019-12-01  Colombo     Finance   77600.0
4         16265    Ruwan Rathnayake 2019-06-01   Jaffna          IT   88750.0
..          ...                 ...        ...      ...         ...       ...
95        77563    Thilini De Alwis 2017-02-01    Kandy          HR   71400.0
96        12695      Kasun De Alwis 2022-09-01    Galle   Marketing   73900.0
97        58190     Suresh Fernando 2019-05-01    Galle  Operations   79700.0
98        15258   Rashmi Rathnayake 2021-01-01    Kandy          HR   88750.0
99        97538      Malsha Bandara 2025-10-01    Kandy  Operations  134600.0

[100 rows x 6 columns]

In [384]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Employee_ID  100 non-null    int64
 1   Name         100 non-null    object
 2   Join_Date    100 non-null    datetime64[ns]
 3   City         100 non-null    object
 4   Department   100 non-null    object
 5   Salary       100 non-null    float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 4.8+ KB

Export dataset

In [385]:
df.to_csv("SL_employees_cleaned_stepwise.csv")